Revit 2027 API
BuiltInFailures.ElectricalFailures.NotAllowedCableTrayConduitRotation Property
 Don't allow to rotate a horizontal cable tray/conduit like this
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotAllowedCableTrayConduitRotation { get; }
Public Shared ReadOnly Property NotAllowedCableTrayConduitRotation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotAllowedCableTrayConduitRotation {
	FailureDefinitionId^ get ();
}
static member NotAllowedCableTrayConduitRotation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace